#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
tf/env/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/tcry.pt/tcry.pt/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/tcry.pt/tcry.pt

To view this run in a browser, visit:
https://app.terraform.io/app/tcrypt/production-tcrypt/runs/run-n3YFSiCp5aG6u9Yk

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.tcrypt.data.template_file.cloud_init: Refreshing state... [id=5db985ed8a369b7a1098e0dcf68f946546a6b54de79a44060240c637b6f9bea4]
module.tcrypt.digitalocean_record.code: Refreshing state... [id=120617221]
module.tcrypt.digitalocean_vpc.region_2: Refreshing state... [id=871ad150-ef6a-4af9-b6e0-160d67864baf]
module.tcrypt.digitalocean_vpc.region_1: Refreshing state... [id=2b0aaf42-a9b4-4226-aeb3-32acc2973103]
module.tcrypt.digitalocean_volume.region_1[0]: Refreshing state... [id=4415a40b-293b-11eb-b10a-0a58ac1422e5]
module.tcrypt.digitalocean_droplet.compute_workers_region_2[0]: Refreshing state... [id=216479229]
module.tcrypt.digitalocean_droplet.compute_workers_region_1[0]: Refreshing state... [id=216478801]
module.tcrypt.digitalocean_droplet.compute_workers_region_1[1]: Refreshing state... [id=216478799]
module.tcrypt.digitalocean_floating_ip.proxy_1: Refreshing state... [id=167.172.9.215]
module.tcrypt.digitalocean_domain.root: Refreshing state... [id=tcry.pt]
module.tcrypt.digitalocean_record.mail_verification["1"]: Refreshing state... [id=120617220]
module.tcrypt.digitalocean_record.mail_verification["0"]: Refreshing state... [id=120617225]
module.tcrypt.digitalocean_record.mail_verification["2"]: Refreshing state... [id=120617226]
module.tcrypt.digitalocean_record.mail_cname["2"]: Refreshing state... [id=120617222]
module.tcrypt.digitalocean_record.mail_mx["1"]: Refreshing state... [id=120617218]
module.tcrypt.digitalocean_record.mail_mx["0"]: Refreshing state... [id=120617224]
module.tcrypt.digitalocean_record.mail_cname["0"]: Refreshing state... [id=120617219]
module.tcrypt.digitalocean_record.mail_cname["1"]: Refreshing state... [id=120617223]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.tcrypt.digitalocean_record.code will be destroyed
  - resource "digitalocean_record" "code" {
      - domain   = "tcry.pt" -> null
      - flags    = 0 -> null
      - fqdn     = "*.tcry.pt" -> null
      - id       = "120617221" -> null
      - name     = "*" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "167.172.9.215" -> null
      - weight   = 0 -> null
    }

  # module.tcrypt.digitalocean_record.internal will be created
  + resource "digitalocean_record" "internal" {
      + domain = "tcry.pt"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "in"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "100.76.128.85"
    }

  # module.tcrypt.digitalocean_record.wildcard will be created
  + resource "digitalocean_record" "wildcard" {
      + domain = "tcry.pt"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "*"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "167.172.9.215"
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>

*Pusher: @tyler-smith, Action: `pull_request`*